class Product {
  final int id;
  final int price;
  final String title;
  final String subTitle;
  final String image;
  final String description;

  Product(this.id, this.price, this.title, this.subTitle, this.image,
      this.description);

  
}

List<Product> products = [
  Product(
    1,
    59,
    "سماعات لاسلكية",
    "جودة صوت عالية",
    "images/airpod.png",
    "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.",
  ),
  Product(
    2,
    1099,
    "جهاز موبايل",
    "وأصبح للموبايل قوة",
    "images/mobile.png",
    "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.",
  ),
  Product(
    3,
    39,
    "نظارات ثلاثية الأبعاد",
    "لنقلك للعالم الافتراضي",
    "images/class.png",
    "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.",
  ),
  Product(
    4,
    56,
    "سماعات",
    "لساعات استماع طويلة",
    "images/headset.png",
    "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.",
  ),
  Product(
    5,
    68,
    "مسجل صوت",
    "سجل اللحظات المهمة حولك",
    "images/speaker.png",
    "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.",
  ),
  Product(
    6,
    39,
    "كاميرات كمبيوتر",
    "بجودة ودقة صورة عالية",
    "images/camera.png",
    "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.",
  ),
];
